Revit 2027 API
StructuralConnectionSettings.GetStructuralConnectionSettings Method
 Obtains the StructuralConnectionSettings object for the specified project document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static StructuralConnectionSettings GetStructuralConnectionSettings(
	Document document
)
Public Shared Function GetStructuralConnectionSettings (
	document As Document
) As StructuralConnectionSettings
public:
static StructuralConnectionSettings^ GetStructuralConnectionSettings(
	Document^ document
)
static member GetStructuralConnectionSettings :
        document : Document -> StructuralConnectionSettings
Parameters
document Document
 A project document.
Return Value
StructuralConnectionSettings
 The StructuralConnectionSettings object.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
StructuralConnectionSettings Class
Autodesk.Revit.DB.Structure Namespace